website/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-01-18 Thu 20:05 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Sebastian Schmidt" />
<meta name="generator" content="Org Mode" />

<link rel='stylesheet' type='text/css' href='org_html_export.css' />

</head>
<body>
<div id="content" class="content">
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd638e27">1. Search for solar axions using a 7-GridPix IAXO prototype detector at CAST</a>
<ul>
<li><a href="#org52ca566">1.1. Abstract</a></li>
<li><a href="#org1917e5d">1.2. Data</a></li>
<li><a href="#org45a6391">1.3. Software</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-orgd638e27" class="outline-2">
<h2 id="orgd638e27"><span class="section-number-2">1.</span> Search for solar axions using a 7-GridPix IAXO prototype detector at CAST</h2>
<div class="outline-text-2" id="text-1">
<p>
This is the companion website to my PhD thesis of the above title. At
the time of writing this, <span class="timestamp-wrapper"><span class="timestamp">&lt;2024-01-18 Thu 18:49&gt;</span></span>, it does not yet link
to the entire thesis document. That will only be done once the thesis
has been defended and published (it seems like otherwise I might get
into trouble).
</p>
</div>

<div id="outline-container-org52ca566" class="outline-3">
<h3 id="org52ca566"><span class="section-number-3">1.1.</span> Abstract</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The Standard Model of particle physics (SM) is extremely successful at
describing three out of the four known fundamental forces of
nature. However, there are several open questions even within the
SM. One of those is termed the 'strong CP problem'. In a simplified
way it asks why the neutron does not have an electric dipole
moment. While only a mathematical problem of sorts, it can be neatly
solved by the introduction of a new hypothetical particle, the
<i>axion</i>. This particle can interact with photons and leptons, even if
extremely feebly. If they exist, they will be produced in the 
core of the Sun at very high rates, but easily escape similar to
neutrinos. On the Earth we can attempt to detect them using strong
magnetic fields. The latest such experiment, a solar helioscope, is
the CERN Axion Solar Telescope (CAST). Axions carry the energy of the
photons, which initially produced them, placing them in the soft X-ray
energy range.
</p>

<p>
In the course of this thesis, a gaseous detector using 7-GridPixes as
its readout was deployed at the CAST experiment in 2017/18 to follow
up on previous measurements with a single GridPix detector in
2014/15. \(\SI{3150}{h}\) of background data and \(\SI{160}{h}\) of solar
tracking data was taken. The data taken at such an experiment is
dominated by cosmic radiation, radioactive background and X-ray
fluorescence. As such methods to suppress this background and extract
the few possible axion signals are needed. A software library
<code>TimepixAnalysis</code> was developed in the course of this thesis to
reconstruct and analyze the data taken at CAST.
</p>

<p>
For the classification of event data into background-like or
signal-like (X-ray) data, a machine learning approach is used. A
multilayer perceptron (MLP, simple type of an artificial neural
network) was trained on synthetic X-ray data and CAST background data
of 6 of the 7 chips (leaving out the chip sensitive to axions). This
method significantly improves the signal efficiency at comparable
background rates, when compared to the likelihood cut method used for
the old detector.
</p>

<p>
Further, as no excess signal was detected in the solar tracking
dataset, a limit calculation method was developed. This method builds on the
unbinned Bayesian likelihood method used in CAST's Nature paper
in 2017. It is extended to allow the inclusion of systematic
uncertainties as nuisance parameters. Due to the very expensive
evaluation of such a likelihood function, a Markov Chain Monte Carlo
(MCMC) approach is used.
</p>

<p>
One of the limit calculation inputs is the 'axion image' produced by
the Lawrence Livermore National Laboratory (LLNL) telescope at
CAST. To properly characterize this, a raytracing simulation taking
into account the axion production rates in the Sun and reflection
through the X-ray optic was developed. It was verified against
PANTER measurements of the telescope.
</p>

<p>
With the software advances and improved detector features, world best
limits could be set on the axion-electron coupling and on the
chameleon coupling (a separate hypothetical particle). The previous
best limit on the axion-electron coupling is improved from
\(g_{ae}·g_{aγ} \lesssim \SI{8.1e-23}{GeV⁻¹}\) to \(g_{ae}·g_{aγ}
\lesssim \SI{7.35e-23}{GeV⁻¹}\) and the chameleon coupling from \(β_γ <
\num{5.74e10}\) to \(β_γ \lesssim \num{3.1e+10}\).
</p>

<p>
In addition, the software developed during the course of this thesis
was written with future detectors in mind. It is in principle ready
for data analysis for a GridPix3 based future detector.
</p>
</div>
</div>

<div id="outline-container-org1917e5d" class="outline-3">
<h3 id="org1917e5d"><span class="section-number-3">1.2.</span> Data</h3>
<div class="outline-text-3" id="text-1-2">
<p>
One of the most important parts for my thesis has always been being
able to replicate results. Part of that is providing access to my
data, including the raw data taken with our detector at CAST.
</p>

<p>
Due to some technical issues with <a href="https://zenodo.org">Zenodo</a> I haven't been able to
successfully upload my data to their servers so far (the connection is
closed before the upload finishes).
</p>

<p>
For that reason, for the time being until I manage this, you can find
the entire raw dataset under this Google Drive link:
</p>

<p>
<a href="https://drive.google.com/file/d/1o57wgDeVW82BmL_lHH-ZRm5zHXRWWVYI/view?usp=drive_link">https://drive.google.com/file/d/1o57wgDeVW82BmL_lHH-ZRm5zHXRWWVYI/view?usp=drive_link</a>
</p>

<p>
(I hope I don't regret this :) )
</p>
</div>
</div>

<div id="outline-container-org45a6391" class="outline-3">
<h3 id="org45a6391"><span class="section-number-3">1.3.</span> Software</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The main repository used in my thesis is <a href="https://github.com/Vindaar/TimepixAnalysis">TimepixAnalysis</a>. See the
appendix about the software and how to reconstruct all data in the
thesis for more information.
</p>

<p>
The results in the thesis were all produced with the git tag <code>phd_rc0</code>
(at the time of writing, I still have to finalize the git tags for
<code>datamancer</code>, <code>ggplotnim</code>, <code>unchained</code>, <code>nimhdf5</code> and maybe a couple
more libraries that I've tinkered with in the final days of
writing). Once the final thesis is published I'll create a <code>phd</code> tag
(and make sure I didn't break anything in between).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sebastian Schmidt</p>
<p class="date">Created: 2024-01-18 Thu 20:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>